In [1]:
## Import basic libraries

import pandas as pd
import numpy as np

In [2]:
## Know the class types of the following

a = ['List1','list2']
b = 23
c = 'String'

In [3]:
## Use print statements to see output

print (type(a))
print (type(b))
print (type(c))

<class 'list'>
<class 'int'>
<class 'str'>

In [4]:
## Check a variable data

a

['List1', 'list2']

In [5]:
## Series is a 1-D labelled array 

d  = pd.Series([12,1,14,56])
print(type(d))
d

<class 'pandas.core.series.Series'>

0    12
1     1
2    14
3    56
dtype: int64

In [6]:
## Convert list to data frame

df = pd.DataFrame(a)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

       0
0  List1
1  list2

In [7]:
## Create empty data frame 

edf = pd.DataFrame()
edf

Empty DataFrame
Columns: []
Index: []

In [8]:
## Create a data frame using dictionary


df0 = pd.DataFrame({'id':[1,2,3],'name':['a','b','c']})
print(type(df0))
df0

<class 'pandas.core.frame.DataFrame'>

   id name
0   1    a
1   2    b
2   3    c

In [9]:
## Add a new column (Here we're getting name column values length)

df0['new_column'] = df0['name'].str.len()
df0['new_column']

0    1
1    1
2    1
Name: new_column, dtype: int64

In [10]:
## Sample execrise data frame

data = pd.DataFrame({'col1':[1,1,2,44,5,6],'col2':['a','aa','bb','c','d','e']})
data

   col1 col2
0     1    a
1     1   aa
2     2   bb
3    44    c
4     5    d
5     6    e

In [11]:
## Sort values using a column as main and pandas takes it as index column

data1 = data.sort_values(by=['col1'])
data1

   col1 col2
0     1    a
1     1   aa
2     2   bb
4     5    d
5     6    e
3    44    c

In [12]:
## Get summary of your data

data1.describe(include='all')

             col1 col2
count    6.000000    6
unique        NaN    6
top           NaN    a
freq          NaN    1
mean     9.833333  NaN
std     16.869104  NaN
min      1.000000  NaN
25%      1.250000  NaN
50%      3.500000  NaN
75%      5.750000  NaN
max     44.000000  NaN

In [13]:
## Create a new column by using apply and lambda functions
## Here we're adding +1 to each rows in col1 by creating col3

data1['col3'] = data1['col1'].apply(lambda x:x+1)
data1

   col1 col2  col3
0     1    a     2
1     1   aa     2
2     2   bb     3
4     5    d     6
5     6    e     7
3    44    c    45

In [14]:
## Convert datetime values from string to datetime

dts = pd.DataFrame({'dates':['28-03-2012  2:15:00 PM','28-03-2012  2:17:28 PM','28-03-2012  2:50:50 PM']})
dts

                    dates
0  28-03-2012  2:15:00 PM
1  28-03-2012  2:17:28 PM
2  28-03-2012  2:50:50 PM

In [16]:
dts.dtypes

dates    object
dtype: object

In [17]:
dts['dates']= pd.to_datetime(dts['dates'],errors='coerce')

In [18]:
## Store date alone

dts['dates'].dt.date

0    2012-03-28
1    2012-03-28
2    2012-03-28
Name: dates, dtype: object

In [19]:
dts.dtypes

dates    datetime64[ns]
dtype: object

In [ ]:
## Check out the intermediate series version which will be live soon!